Revit 2026 API

# DataExchangeMessageVerbosity Enumeration

---

Predefined verbosity levels for DataExchangeLog

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum DataExchangeMessageVerbosity
```
```vb
Public Enumeration DataExchangeMessageVerbosity
```
```cpp
public enum class DataExchangeMessageVerbosity
```
```fsharp
type DataExchangeMessageVerbosity
```

| Member name | Value | Description |
| --- | --- | --- |
| Default | 1 | Default verbosity. Warnings, errors, fatal errors are reported. |
| Minimal | 0 | Minimal verbosity. Only fatal errors are reported. |
| Verbose | 2 | All events are reported. |

#### Reference

Autodesk.Revit.DB Namespace